# Basic SQL query 
## what is SQL query?
An SQL query is a request sent to a database to perform operations on the stored data. SQL, or Structured Query Language, is a programming language used to communicate with relational databases. SQL queries are used to retrieve, insert, update, or delete data in a database efficiently and accurately.

## Basic operation

1. **SELECT**: This operation is used to retrieve data from one or more tables in the database. It allows you to specify the columns you want to retrieve and apply filters to narrow down the results. If i need to select all columns then use * to select all columns.
  ```sql
      SELECT column1, column2 FROM table_name WHERE condition ORDER BY column_name;
  ```
2. **INSERT**: This operation is used to add new records (rows) to a table in the database. You provide the values for the columns in the new record that you want to insert.
  ```sql
  INSERT INTO table_name (column1, column2) VALUES (value1, value2);
  ```
3. **UPDATE**: This operation is used to modify existing records in a table. You specify which columns you want to update and provide the new values for those columns.
  ```sql
  UPDATE table_name
  SET column1 = new_value1, column2 = new_value2
  WHERE condition;
  ```
4. **DELETE**: This operation is used to remove records from a table based on specified conditions. It permanently deletes the records from the table.
  ```sql
  DELETE FROM table_name
  WHERE condition;
  ```

## Example via SQLite3 in python

Use Pandas to read(write) data from(to) sqlite database:

In [1]:
import sqlite3
import pandas as pd 
conn = sqlite3.connect('mydatabase.db')
df=pd.DataFrame({'id':[1,2,3,4,5],'name':['John','Emma','Rob','Sam','Sara'],'age':[30,25,35,40,45]})
df.to_sql('mytable', conn, if_exists='replace', index = False)
c = conn.cursor()
c.execute("SELECT * FROM mytable")
print(c.fetchall())
dft=pd.read_sql_query("SELECT * FROM mytable", conn)
dft
conn.close()

[(1, 'John', 30), (2, 'Emma', 25), (3, 'Rob', 35), (4, 'Sam', 40), (5, 'Sara', 45)]

In [2]:
dft

   id  name  age
0   1  John   30
1   2  Emma   25
2   3   Rob   35
3   4   Sam   40
4   5  Sara   45

insert data to mytable

In [3]:
import sqlite3
import pandas as pd 
conn = sqlite3.connect('mydatabase.db')
cursor=conn.cursor()
cursor.execute("INSERT INTO mytable (id, name, age) VALUES (6, 'Tom', 50)")
conn.commit()

In [13]:
dft=pd.read_sql_query("SELECT * FROM mytable", conn)
# dft.loc[dft.name=='Tom']
n='Tom'
# dft.query('name=="Tom"')
# dft.query('name==@n')
dft.query('(age>=25) and (age<=40)')

   id  name  age
0   1  John   30
1   2  Emma   25
2   3   Rob   35
3   4   Sam   40

update data in mytable

In [14]:
conn = sqlite3.connect('mydatabase.db')
cursor=conn.cursor()
cursor.execute("UPDATE mytable SET age = 55 WHERE name = 'Tom'")
conn.commit()

In [15]:
dft=pd.read_sql_query("SELECT * FROM mytable", conn)
dft.query('name=="Tom"')

   id name  age
5   6  Tom   55

Delete data from mytable

In [17]:
conn = sqlite3.connect('mydatabase.db')
cursor=conn.cursor()
cursor.execute('DELETE FROM mytable WHERE name="Tom"')
conn.commit()

In [19]:
dft=pd.read_sql_query("SELECT * FROM mytable", conn)
# dft.query('name=="Tom"')
dft

   id  name  age
0   1  John   30
1   2  Emma   25
2   3   Rob   35
3   4   Sam   40
4   5  Sara   45